// $(document).ready(function () {
// //êîä jQuery

// //ôóíêöèÿ âûçîâà òàéìåðà
// function get_timer() {
  
//   //Äàòà äëÿ îáðàòíîãî îòñ÷åòà
//   var date_new = dateEnd; // June 3,2012 02:00
//   ////////////////////////////////////
//   ////////////////////////////////////
  
//   //Îáúåêò äàòû äëÿ îáðàòíîãî îòñ÷åòà
//   var date_t = new Date(date_new);
//   //Îáúåêò òåêóùåé äàòû
//   var date = new Date();
//   //Âû÷åñëÿåì ñêîëüêî ìèëëèñåêóíä ïðîéäåò 
//   //îò òåêóùåé äàòû äî äàòû îòñ÷åòà âðåìåíè
//   var timer = date_t - date;
  
//   //Ïðîâåðÿåì íå íóæíî ëè çàêîí÷èòü îòñ÷åò
//   //åñëè äàòà îòñ÷åòà åùå íå èñòåêëà, òî êîëè÷åñòâî
//   //ìèëëèñåêóíä â ïåðåìåííîé date_t áóäåò áîëüøå ÷åì â ïåðåìåííîé date
//   if(date_t > date) {
    
//     //Âû÷èñëÿåì ñêîëüêî îñòàëîñü äíåé äî äàòû îòñ÷åòà.
//     //Äëÿ ýòîãî êîëè÷åñòâî ìèëëèñåêóíä äî äàòû îñò÷åòà äåëèì
//     //íà êîëè÷åñòâî ìèëëèñåêóíä â îäíîì äíå
//     var day = parseInt(timer/(60*60*1000*24));
//     //åñëè ïîëó÷åííîå ÷èñëî ìåíüøå 10 ïðèáàâëÿåì 0
//     if(day < 10) {
//       day = '0' + day;
//     }
//     //Ïðèâîäèì ðåçóëüòàò ê ñòðîêå
//     day = day.toString();
      
//     //Âû÷èñëÿåì ñêîëüêî îñòàëîñü ÷àñîâ äî äàòû îòñ÷åòà.
//     //Äëÿ ýòîãî ïåðåìåííóþ timer äåëèì íà êîëè÷åñòâî
//     //ìèëëèñåêóíä â îäíîì ÷àñå è îòáðàñûâàåì äíè
//     var hour = parseInt(timer/(60*60*1000))%24;
//     //åñëè ïîëó÷åííîå ÷èñëî ìåíüøå 10 ïðèáàâëÿåì 0
//     if(hour < 10) {
//       hour = '0' + hour;
//     }
//     //Ïðèâîäèì ðåçóëüòàò ê ñòðîêå
//     hour = hour.toString();
      
//     //Âû÷èñëÿåì ñêîëüêî îñòàëîñü ìèíóò äî äàòû îòñ÷åòà.
//     //Äëÿ ýòîãî ïåðåìåííóþ timer äåëèì íà êîëè÷åñòâî
//     //ìèëëèñåêóíä â îäíîé ìèíóòå è îòáðàñûâàåì ÷àñû
//     var min = parseInt(timer/(1000*60))%60;
//     //åñëè ïîëó÷åííîå ÷èñëî ìåíüøå 10 ïðèáàâëÿåì 0
//     if(min < 10) {
//       min = '0' + min;
//     }
//     //Ïðèâîäèì ðåçóëüòàò ê ñòðîêå
//     min = min.toString();
      
//     //Âû÷èñëÿåì ñêîëüêî îñòàëîñü ñåêóíä äî äàòû îòñ÷åòà.
//     //Äëÿ ýòîãî ïåðåìåííóþ timer äåëèì íà êîëè÷åñòâî
//     //ìèëëèñåêóíä â îäíîé ìèíóòå è îòáðàñûâàåì ìèíóòû
//     var sec = parseInt(timer/1000)%60;
//     //åñëè ïîëó÷åííîå ÷èñëî ìåíüøå 10 ïðèáàâëÿåì 0
//     if(sec < 10) {
//       sec = '0' + sec;
//     }
//     //Ïðèâîäèì ðåçóëüòàò ê ñòðîêå
//     sec = sec.toString();
    
//     //Âûâîäèì äíè
//     //Ïðîâåðÿåì êàêèå ïðåäûäóùèå öèôðû âðåìåíè äîëæíû âûâåñòèñü íà ýêðàí
//     //Äëÿ äåñÿòêîâ äíåé
//     if(day[1] == 9 && 
//       hour[0] == 2 && 
//       hour[1] == 3 && 
//       min[0] == 5 && 
//       min[1] == 9 && 
//       sec[0] == 5 && 
//       sec[1] == 9) {
//       animation($("#day0"),day[0]);
//     }
//     else {
//       $("#day0").html(day[0]);
//     }
//     //Äëÿ åäèíèö äíåé
//     if(hour[0] == 2 && 
//       hour[1] == 3 && 
//       min[0] == 5 && 
//       min[1] == 9 && 
//       sec[0] == 5 && 
//       sec[1] == 9) {
//       animation($("#day1"),day[1]);
//     }
//     else {
//       $("#day1").html(day[1]);
//     }
//     //Âûâîäèì ÷àñû
//     //Ïðîâåðÿåì êàêèå ïðåäûäóùèå öèôðû âðåìåíè äîëæíû âûâåñòèñü íà ýêðàí
//     //Äëÿ äåñÿòêîâ ÷àñîâ
//     if(hour[1] == 3 && 
//       min[0] == 5 && 
//       min[1] == 9 && 
//       sec[0] == 5 && 
//       sec[1] == 9) {
//       animation($("#hour0"),hour[0]);
//     }
//     else {
//       $("#hour0").html(hour[0]);
//     }
//     //Äëÿ åäèíèö ÷àññîâ 
//     if(min[0] == 5 && 
//       min[1] == 9 && 
//       sec[0] == 5 && 
//       sec[1] == 9) {
//       animation($("#hour1"),hour[1]);
//     }
//     else {
//       $("#hour1").html(hour[1]);
//     }
      
//     //Âûâîäèì ìèíóòû
//     //Ïðîâåðÿåì êàêèå ïðåäûäóùèå öèôðû âðåìåíè äîëæíû âûâåñòèñü íà ýêðàí
//     //Äëÿ äåñÿòêîâ ìèíóò
//     if(min[1] == 9 && 
//       sec[0] == 5 && 
//       sec[1] == 9) {
//       animation($("#min0"),min[0]);
//     }
//     else {
//       $("#min0").html(min[0]);
//     }
//     //Äëÿ åäèíèö ìèíóò
//     if(sec[0] == 5 && sec[1] == 9) {
//       animation($("#min1"),min[1]);
//     }
//     else {
//       $("#min1").html(min[1]);
//     }
      
//     //Âûâîäèì ñåêóíäû
//     //Ïðîâåðÿåì êàêèå ïðåäûäóùèå öèôðû âðåìåíè äîëæíû âûâåñòèñü íà ýêðàí
//     //Äëÿ äåñÿòêîâ ñåêóíä
//     if(sec[1] == 9) {
//       animation($("#sec0"),sec[0]);
//     }
//     else {
//       $("#sec0").html(sec[0]);
//     }
//     animation($("#sec1"),sec[1]); 
//     //Ïåðåîäè÷åñêè âûçûâàåì ñîçäàííóþ ôóíêöèþ, 
//     //èíòåðâàë âûçîâà îäíà ñåêóíäà(1000 ìèëëè ñåêóíä)
//     setTimeout(get_timer,1000);
//   }
//   else {
//     $("#clock").html("<span id='stop'>Îòñ÷åò çàêîí÷åí!!!</span>");
//   }
  
// }
// //Ôóíêöèÿ äëÿ êðàñèâîãî îòîáðàæåíèÿ âðåìåíè.
// function animation(vibor,param) {
//   vibor.html(param)
//     .css({});
// }
// //Âûçûâàåì ôóíêöèþ íà èñïîëíåíèå
// get_timer();
// });